v2206/Projects/solverTests/ADTank_refine/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// GeoShaft_s.stl { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 135; }

//     subsetFeatures
//     {
//         nonManifoldEdges        no;
//         openEdges               no;
//     }
// }

// GeoTank_s.stl {
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        no;
//         openEdges               no;
//     }
// }

GeoShaft_ss.stl { 
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 135; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}

GeoTank_ss.stl {
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 150; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}


// ************************************************************************* //
